//L01MAP  JOB (ACCT),'CICS LAB01 BMS',CLASS=A,MSGCLASS=X
//*
//MAPASM EXEC PGM=ASMA90,PARM='OBJECT,SYSPARM(MAP)'
//SYSLIB DD DSN=DFH410.CICS.SDFHMAC,DISP=SHR
//SYSUT1 DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT2 DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT3 DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSPRINT DD SYSOUT=*
//SYSLIN DD DSN=&&MAPOBJ,UNIT=SYSDA,SPACE=(CYL,(1,1)),DISP=(MOD,PASS)
//SYSIN DD DSN=IBMUSER.CICS.MAPS(L01MAPS),DISP=SHR
//*
//LINKMAP EXEC PGM=IEWL,COND=(0,NE,MAPASM),PARM='LIST,XREF,LET,RENT'
//SYSPRINT DD SYSOUT=*
//SYSUT1 DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSLIN DD DSN=&&MAPOBJ,DISP=(OLD,DELETE)
//SYSLMOD DD DSN=IBMUSER.CICS.LOAD(L01MAPS),DISP=SHR
//*
//DSECT EXEC PGM=ASMA90,COND=(0,NE,LINKMAP),PARM='DECK,NOOBJECT,SYSPARM(DSECT)'
//SYSLIB DD DSN=DFH410.CICS.SDFHMAC,DISP=SHR
//SYSUT1 DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT2 DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSUT3 DD UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSPRINT DD SYSOUT=*
//SYSPUNCH DD DSN=IBMUSER.CICS.COPY(L01MAPS),DISP=SHR
//SYSIN DD DSN=IBMUSER.CICS.MAPS(L01MAPS),DISP=SHR
//
